src/AccumulationRegisters/ДенежныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредства</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БанковскийСчетКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/ТипыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/AccumulationRegisters/ДенежныеСредства/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция ПолучитьОстатокПоКассе(Знач кассаСсылка, Знач моментВремени = Неопределено) Экспорт
    Возврат получитьОстатокПо(кассаСсылка, моментВремени);
КонецФункции

Функция ПолучитьОстатокПоРасчетномуСчету(Знач расчетныйСчетСсылка, Знач моментВремени = Неопределено) Экспорт
    Возврат получитьОстатокПо(расчетныйСчетСсылка, моментВремени);
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Функция получитьОстатокПо(Знач расчетныйСчетИлиКассаСсылка, Знач моментВремени = Неопределено)
    этоКасса = ТипЗнч(расчетныйСчетИлиКассаСсылка) = Тип("СправочникСсылка.Касса");
    этоРасчетныйСчет = ТипЗнч(расчетныйСчетИлиКассаСсылка) = Тип("СправочникСсылка.БанковскиеСчета");

    ДиагностикаКлиентСервер.Утверждение(этоКасса ИЛИ этоРасчетныйСчет,
        "Неверное значение аргумента ""РасчетныйСчетИлиКассаСсылка"", значение должно иметь тип в диапазоне: [
        |   ""СправочникСсылка.Касса"",
        |   ""СправочникСсылка.БанковскиеСчета""
        |]");

    запросОстаткиДС = Новый Запрос;
    запросОстаткиДС.Текст = сформироватьЗапросНаПолучениеОстаткаПо(этоКасса, моментВремени <> Неопределено);

    имяИзмерения = ?(этоКасса, "Касса", "РасчетныйСчет");
    запросОстаткиДС.УстановитьПараметр(имяИзмерения, расчетныйСчетИлиКассаСсылка);

    Если моментВремени <> Неопределено Тогда
        запросОстаткиДС.УстановитьПараметр("МоментВремени", моментВремени);
    КонецЕсли;

    результатЗапроса = запросОстаткиДС.Выполнить();
    Если результатЗапроса.Пустой() Тогда
        Возврат Неопределено;
    КонецЕсли;

    результат = Новый Структура(СтрШаблон("%1, Сумма", имяИзмерения));
    выборка = результатЗапроса.Выбрать();
    выборка.Следующий();
    ЗаполнитьЗначенияСвойств(результат, выборка);
    Возврат выборка;
КонецФункции

Функция сформироватьЗапросНаПолучениеОстаткаПо(Знач этоКасса = Ложь, Знач наМоментВремени = Ложь)
    результат =
        "ВЫБРАТЬ
        |	ДенежныеСредстваОстатки.БанковскийСчетКасса.Представление КАК РасчетныйСчет,
        |	ДенежныеСредстваОстатки.СуммаОстаток КАК Сумма
        |ИЗ
        |	РегистрНакопления.ДенежныеСредства.Остатки(
        |		&МоментВремени,
        |		БанковскийСчетКасса = &РасчетныйСчет
        |			И ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)) КАК ДенежныеСредстваОстатки
        |";

    Если этоКасса Тогда
        результат = СтрЗаменить(результат, "РасчетныйСчет", "Касса");
        результат = СтрЗаменить(результат, "Безналичные", "Наличные");
    КонецЕсли;

    Если НЕ наМоментВремени Тогда
        результат = СтрЗаменить(результат, "&МоментВремени", "");
    КонецЕсли;

    Возврат результат;
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
